app/views/roasts/show.html.erb

<div id="comments">
  <h2><%= @roast.comments.count %>Roasts</h2>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."roast_id" = $1 ORDER BY "comments"."id" ASC LIMIT $2  [["roast_id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."roast_id" = $1  [["roast_id", 4]]