app/controllers/comments_controller.rb

  def create
    @comment = @roast.comments.create(params[:comment].permit[:content])
# so we can check the comments from each user
    @comment.user_id = current_user.id
    @comment.save
---
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 1], ["updated_at", 2017-02-12 04:51:58 UTC], ["id", 2]]

    def find_roast
      @roast = Roast.find(params[:roast_id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]