app/controllers/comments_controller.rb

  def index
    @roasts = Roast.all
    @comments = Comment.all.order(:cached_votes_up => :desc)
---
SELECT "roasts".* FROM "roasts"
SELECT  "comments".* FROM "comments" ORDER BY "comments"."cached_votes_up" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @roast = Roast.find(params[:roast_id])
    @comment = @roast.comments.create(comment_params)
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "roast_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "ok"], ["roast_id", 4], ["created_at", 2017-02-12 21:46:24 UTC], ["updated_at", 2017-02-12 21:46:24 UTC]]

  def destroy
    @roast = Roast.find(params[:roast_id])
    @comment = @roast.comments.find(params[:id])
    @comment.destroy
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."roast_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["roast_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]