app/controllers/roasts_controller.rb

  def index
    @roasts = Roast.all
---
SELECT "roasts".* FROM "roasts"

  def show
    @comments = Comment.where(roast_id: @roast).order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."roast_id" = 4 ORDER BY created_at DESC

  def create
    @user = current_user
    @roast = @user.roasts.build(roast_params)

    respond_to do |format|
      if @roast.save
---
INSERT INTO "roasts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "stuff"], ["user_id", 0], ["created_at", 2017-02-06 22:21:48 UTC], ["updated_at", 2017-02-06 22:21:48 UTC]]

  def update
    respond_to do |format|
      if @roast.update(roast_params)
---
UPDATE "roasts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "roasts"."id" = $5  [["image_file_name", "3.jpg"], ["image_file_size", 63285], ["image_updated_at", 2017-02-09 21:57:08 UTC], ["updated_at", 2017-02-09 21:57:09 UTC], ["id", 5]]

  def destroy
    @roast = Roast.find(params[:id])
    @roast.destroy
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "roasts" WHERE "roasts"."id" = $1  [["id", 2]]

    def set_roast
      @roast = Roast.find(params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]