app/controllers/roast_images_controller.rb

  def index
    @roast_images = RoastImage.all
---
SELECT "roast_images".* FROM "roast_images"

  def create
    @roast_image = RoastImage.new(roast_image_params)

    respond_to do |format|
      if @roast_image.save
---
INSERT INTO "roast_images" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-02-10 21:35:49 UTC], ["updated_at", 2017-02-10 21:35:49 UTC]]

    def set_roast_image
      @roast_image = RoastImage.find(params[:id])
---
SELECT  "roast_images".* FROM "roast_images" WHERE "roast_images"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]